##Выведите все ключи и значения через цикл.

d = {'Red': 1, 'Green': 2}
for x in d.keys():

    print(x, ':', d[x])
